[
  {
    "month": "May",
    "date": "06",
    "number": 3,
    "weekend": false,
    "title": "Variable Fonts",
    "sum": "4 weeks ago, among my many adventures of link clicking at late night, I found out about Variable Fonts. Reading Nick Sherman’s article about his vision of  Web Typography in the future really excited me. Though at the time I thought it is pure science fiction — in type realm, too futuristic and too many development obstacles. 3 weeks ago, I went to San Francisco for my job. At one dinner with coworker, because of my lacking in experience with babies and child education and ability to hold such conversation, I started a random new topic about variable fonts with another quiet dinner goer. A few minutes later I started to get excited because I heard some exciting development on this subject, which was happening as we spoke. I love my job.",
    "levels": [
      {
        "links": [
          {
            "number": "1",
            "type": "research",
            "category": "essay",
            "em": true,
            "title": "The New Web Typography",
            "href": "https://robinrendle.com/essays/new-web-typography/",
            "description": "Web typography is only as strong as its weakest point… It’s often difficult to identify where the weakness in a design system can be found because a failure in programming will often cause a surprising failure in the aesthetics, and vice versa. Take the current implementation of declaring a font-weight in css. At the moment it’s horrendously limiting, and I think this has the effect of blinding us… I believe that these weaknesses in the programming—in the technical limitations of css and within the font formats themselves—have slowly become a weakness in aesthetics."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1",
            "type": "research",
            "category": "essay",
            "em": true,
            "title": "Efficient Web Type, c. 1556",
            "href": "http://kennethormandy.com/journal/efficient-web-type-circa-1556",
            "description": "Haultin’s performance issues in type design mirror our performance issues on the web: “How might a text be received, and read, more efficiently?”. He suggests answers to this this through the design of type itself, but that’s not the only place where this question needs an answer; we’re still facing the same question of typography efficiency today—but much more often it occurs on the web, and less so in the bible. … Practice, taking advantage of established approaches. Prospects, looking to upcoming technologies. Precedence, viewing the punchcutter’s process as precedence for designer’s role in web performance."
          },
          {
            "number": "1.2",
            "type": "research",
            "category": "essay",
            "em": true,
            "title": "Variable Fonts for Responsive Design",
            "href": "http://alistapart.com/blog/post/variable-fonts-for-responsive-design",
            "description": "Choosing typefaces for use on the web today is a practice of specifying static fonts with fixed designs. But what if the design of a typeface could be as flexible and responsive as the layout it exists within?"
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.2.1",
            "type": "tech",
            "category": "archive",
            "em": false,
            "title": "Multiple Master Fonts",
            "href": "http://partners.adobe.com/public/developer/opentype/index_mult_master.html",
            "description": "Multiple master fonts are Type 1 font programs that include two or more \"master\" fonts within a single font file. It allows users to interpolate many intermediate \"instances\" of the typeface. The fonts have one or more \"axes\" which might typically represent the weight, width, or optical size of the font. Thus the user can generate a very large number of variations from a single font - thus providing unprecedented flexibility."
          },
          {
            "number": "1.2.2",
            "type": "tech",
            "category": "code",
            "em": false,
            "title": "Font‑To‑Width (FTW!)",
            "href": "http://font-to-width.com/",
            "description": "Font‑To‑Width (FTW!) is a script by Nick Sherman and Chris Lewis that takes advantage of large type families to fit pieces of text snugly within their containers. Unlike other text-fitting tools like FitText.js, Font‑To‑Width does not scale the font-size (at least not by default). Instead, it chooses a width or weight variant according to what fits best, and then allows for letter- and word-spacing adjustments as needed."
          },
          {
            "number": "1.2.3",
            "type": "tech",
            "category": "code",
            "em": true,
            "title": "Live Font Interpolation on the Web",
            "href": "http://alistapart.com/article/live-font-interpolation-on-the-web",
            "description": "As typographers, designers, and developers, we can solve this problem. But we’ll need to work together to make webfonts more systemized and context-aware. Live webfont interpolation—the modification of a font’s design in the browser—exists today and can serve as an inroad for using truly responsive typography."
          },
          {
            "number": "1.2.4",
            "type": "research",
            "category": "essay",
            "em": false,
            "title": "Font Hinting and the Future of Responsive Typography",
            "href": "http://alistapart.com/column/font-hinting-and-the-future-of-responsive-typography",
            "description": "Thinking about it in these terms, hinting is responsive type that existed before the web: The font performs a media query of sorts to learn its size, then responds by repositioning points in each glyph according to built-in instructions, or “hints.”. In other words, hinting is to fonts what responsive layout is to websites. It allows a single font file to adapt to a variety of contexts, the same way CSS allows a single HTML file to adapt to a variety of contexts."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.2.3.1",
            "type": "research",
            "category": "tool",
            "em": true,
            "title": "A Glossary of Common Type Terminology",
            "href": "https://www.fontshop.com/glossary/",
            "description": ""
          },
          {
            "number": "1.2.3.2",
            "type": "tech",
            "category": "story",
            "em": false,
            "title": "MutatorMath",
            "href": "http://letterror.com/2014/09/19/mutatormath/",
            "description": "Together with Petr van Blokland and Just van Rossum, we added algorithm support for the basic contour and glyph objects in RoboFog around 1997. This meant glyph objects could participate in basic math operations. This resulted in a reduction in code and at the same time invited a new level of complexity."
          },
          {
            "number": "1.2.3.3",
            "type": "tech",
            "category": "math",
            "em": false,
            "title": "Interpolation Theory",
            "href": "http://www.lucasfonts.com/about/interpolation-theory/",
            "description": "Luc(as) de Groot’s Interpolation Theory is a theory about the optical behaviour of a family of fonts of increasing weight. It has resulted in a formula for calculating intermediate weights that has been influential among type designers the world over."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.2.3.2.1",
            "type": "research",
            "category": "essay",
            "em": false,
            "title": "The Adobe Originals Silver Anniversary Story: How the Originals endured in an ever-changing industry",
            "href": "http://blog.typekit.com/2014/07/30/the-adobe-originals-silver-anniversary-story-how-the-originals-endured-in-an-ever-changing-industry/",
            "description": "This is the seventh in a series of articles from Tamye Riggs, a longtime lover of type who is working with us to celebrate the twenty-fifth anniversary of the Adobe Originals type design program. This post explores multiple master fonts and OpenType, and how the Adobe Type team continued to innovate in type design and font technology."
          },
          {
            "number": "1.2.3.2.2",
            "type": "tech",
            "category": "tool",
            "em": false,
            "title": "New from Adobe Type: Open-sourced font development tools",
            "href": "http://blog.typekit.com/2014/09/19/new-from-adobe-type-open-sourced-font-development-tools/",
            "description": "The AFDKO, or Adobe Font Development Kit for OpenType — is now available with an Apache open source license… recently we’ve been using the ADFKO in conjunction with Superpolator from Erik van Blokland, which provides a convenient user interface and a level of flexibility unavailable with other interpolation tools."
          }
        ]
      }
    ]
  },
  {
    "month": "May",
    "date": "05",
    "number": 2,
    "weekend": false,
    "title": "Vertical Rhythm",
    "sum": "While designing this website, I was torn on whether I should make it stick to a vertical grid. I read many articles about this particular topic. The one I agree the most is “The New Web Typography”. For the past few years, Web Typography is playing catch up, trying to achieve what has been done on the print. Web is a new medium, very different than print, and it is facing a lot of new challenges. Instead of doing everything “by the book”, new rules should be defined, and old rules that doesn’t apply any more should be tossed. Treat Web Typography as its own unique art form and medium.",
    "levels": [
      {
        "links": [
          {
            "number": "1",
            "type": "tech",
            "category": "essay",
            "em": false,
            "title": "Web typography is broken. Here’s how we can fix it",
            "href": "http://www.studiothick.com/essays/web-typography-is-broken/",
            "description": "Questing for the holy grail of web typography: a baseline, cap height, and more in CSS. An exploration in setting type on the web, using MegaType, and other tools."
          },
          {
            "number": "2",
            "type": "tech",
            "category": "essay",
            "em": true,
            "title": "Is Web Typography Completely Broken?",
            "href": "http://zellwk.com/blog/web-typography-broken/",
            "description": "I recently came across an article titled “Web typography is broken. Here’s how we can fix it”. A mix of emotions rushed through me while I read through it. I realized that the biggest argument Tom was making in the article was that web typography is broken because type doesn’t sit perfectly on a baseline grid… I knew the importance of Vertical Rhythm and the baseline grid. I also knew that details matter when it comes to design. But is this one detail enough to break web typography?"
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1",
            "type": "tech",
            "category": "tutorial",
            "em": true,
            "title": "Technical Web Typography: Guidelines and Techniques",
            "href": "https://www.smashingmagazine.com/2011/03/technical-web-typography-guidelines-and-techniques/",
            "description": "We’ll focus on technical type in this article. We’ll discuss the intricacies and nuances of a small set of rules while learning the code to create them. We’ll learn about: How to choose a font face; How to choose a font size; Using a grid; Working out the measure; Vertical rhythm and baseline grids; Choosing a typographic scale; How to use proper quotes; How to use proper dashes; How to use proper ellipses; How to hang punctuation; Dealing with images in grids."
          },
          {
            "number": "1.2",
            "type": "tech",
            "category": "tutorial",
            "em": false,
            "title": "Aligning Type to Baseline the Right Way Using SASS",
            "href": "https://medium.com/written-in-code/aligning-type-to-baseline-the-right-way-using-sass-e258fce47a9b#.a18ynsmfl",
            "description": "Vertical rhythm is about spacing body text or, more generally, vertical stacked elements, in a consistent manner to give structure and hierarchy to your content. The baseline on the other hand implies that content spread in multiple columns is horizontally aligned. These two key principles will always ensure your content with structure, hierarchy, and consistency, and make your body text more readable."
          },
          {
            "number": "1.3",
            "type": "research",
            "category": "essay",
            "em": false,
            "title": "Designing Faster with a Baseline Grid",
            "href": "http://www.teehanlax.com/blog/designing-faster-with-a-baseline-grid/",
            "description": "However, grids are nothing new and can be traced back to Middle Ages: in the 1220s/1240s, French architect Villard de Honnecourt designed construction canons based on geometry. These principles were later studied by typographers and designers in the beginning of the 20th century to reverse-engineer medieval canons of page construction. Among them, Van de Graaf, Rosarivo, and ultimately Tschichold who popularized his predecessors’ discoveries in his book The Form of the Book: Essays on the Morality of Good Design."
          },
          {
            "number": "2.1",
            "type": "tech",
            "category": "essay",
            "em": true,
            "title": "Why is Vertical Rhythm an Important Typography Practice?",
            "href": "http://zellwk.com/blog/why-vertical-rhythms/",
            "description": "So, in summary, Vertical Rhythm is important because it follows one of the principles of design – repetition. Repetition has the ability to make things feel that they belong together. It gives the feeling that someone has thought it all out, like it’s part of the plan. After discovering the link between Vertical Rhythm and Repetition, we went on and figured out several ways we could replicate 24px to bring some variations to the design. Finally, after getting tired of repeating 24px vertically, we tried repeating 24px horizontally as well."
          },
          {
            "number": "2.2",
            "type": "quote",
            "category": "essay",
            "quote": "We can trace a nervous path through the links and hearts that occupy our timelines. In search of answers, we’ve peeked under the covers of Material Design and examined hundreds of pattern libraries, since one of them might be secretly withholding the principles of good design within. But why are we obsessed with typographic rules? And if we were to make guidelines for setting text on the web, what form should those rules take?",
            "author": {
              "name": "Robin Rendle"
            },
            "cite": {
              "title": "The New Web Typography",
              "href": "https://robinrendle.com/essays/new-web-typography/"
            }
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1.1",
            "type": "research",
            "category": "essay",
            "em": true,
            "title": "Web Design is 95% Typography",
            "href": "https://ia.net/know-how/the-web-is-all-about-typography-period",
            "description": "95% of the information on the web is written language. It is only logical to say that a web designer should get good training in the main discipline of shaping written information, in other words: Typography."
          },
          {
            "number": "1.2.1",
            "type": "tech",
            "category": "code",
            "em": true,
            "title": "Megatype",
            "href": "http://www.servinglibrary.org/journal/3/letter-and-spirit",
            "description": "A responsive typographic baseline for the web."
          },
          {
            "number": "1.2.2",
            "type": "tech",
            "category": "code",
            "em": false,
            "title": "Sassline",
            "href": "https://sassline.com/",
            "description": "Sassline aims to spread better typography across the web. It can be used for prototyping, blogs or full website builds. It has recommended base typography styles and Sass mixins to work proportionally from the baseline grid using rems."
          },
          {
            "number": "1.2.3",
            "type": "tech",
            "category": "code",
            "em": false,
            "title": "Siegmeyer2",
            "href": "https://github.com/tbredin/Siegmeyer2",
            "description": "Siegmeyer2 is a static SMACSS boilerplate using Susy grids and Siegmeyer typographic rhythm. It can be used as a standalone boilerplate, or just the SCSS tools can be imported via installation as a bower component (recommended)."
          },
          {
            "number": "2.1.1",
            "type": "tech",
            "category": "essay",
            "em": false,
            "title": "Were We Wrong About Vertical Rhythm All Along?",
            "href": "http://zellwk.com/blog/wrong-about-vertical-rhythm/",
            "description": "Just a few days ago, I received a design critique from Aurobind (a font, newspaper and magazine designer) regarding my website. He specifically pointed out that the spaces between my paragraphs could be reduced to achieve a better effect. I was dumbfounded. I didn’t believe him at first since I was already using Vertical Rhythm. If I were to reduce the amount of space between paragraphs, wouldn’t I be breaking the Vertical Rhythm?"
          }
        ]
      }
    ]
  },
  {
    "month": "May",
    "date": "04",
    "number": 1,
    "weekend": false,
    "title": "Metafont",
    "sum": "Metafont was created almost 30 years ago. It is by no means a new finding. I was researching on parametric type design, and metafont is just exactly what I was looking for. Maybe it is another living proof of the saying “There is nothing new under the sun”. But the new is always born from the old. Soon after I started digging metafont, I found out about Metapolator, and Prototype. These tools are being actively worked on. When I look into it, the latest update could be as late as just 2 days ago. This excites me.",
    "levels": [
      {
        "links": [
          {
            "number": "1",
            "type": "tech",
            "category": "article",
            "em": true,
            "title": "A Note on The Type",
            "href": "http://www.servinglibrary.org/journal/1/a-note-on-the-type",
            "description": "PEN = 0, 1, 1, 0, WEIGHT = 100, SLANT = 0, SUPERNESS = 0.75, CURLYNESS = 0:\nThis is Meta-the-difference-between-the-two-Font, a typeface designed by Dexter Sinister in 2010, and derived using MetaFont, the now-thirty-year-old computer typography system programmed by Donald Knuth in 1979."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1",
            "type": "tech",
            "category": "video",
            "em": false,
            "title": "David Reinfurt: \"Mathematical Typography\"",
            "href": "https://www.youtube.com/watch?v=koc5MDoGW8U",
            "description": "Simplicity: Ideals of Practice in Mathematics & the Arts\nGraduate Center, City University of New York, April 3-5, 2013"
          },
          {
            "number": "1.2",
            "type": "research",
            "category": "article",
            "em": false,
            "title": "Letter & Spirit",
            "href": "http://www.servinglibrary.org/journal/3/letter-and-spirit",
            "description": "In the early 1980s, on the pages of academic design journal Visible Language, a classic thesis-antithesis-synthesis played out around the technological and philosophical fine points of computer-assisted type design. Stanford professor Donald Knuth begins with his article, “The Concept of a Meta-font” (Winter 1981). Two years prior, Knuth had conceived and programmed MetaFont — a software that enabled users to generate unlimited numbers of fonts by controlling a limited set of parameters. The article is a performative account of his intervening attempts, using MetaFont to harness the essential “intelligence” of letterforms."
          },
          {
            "number": "1.3",
            "type": "research",
            "category": "video",
            "em": true,
            "title": "Working on My Letters and Problems With the S",
            "href": "http://www.webofstories.com/play/donald.knuth/55;jsessionid=1653AC9976D7AB2D3093F25FEC16545B",
            "description": ""
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1.1",
            "type": "research",
            "category": "video",
            "em": false,
            "title": "Meta the Difference Between the Two Font 4D",
            "href": "http://www.kadist.org/en/work/meta-difference-between-two-font-4-d",
            "description": "2012, 16:06 minutes"
          },
          {
            "number": "1.3.1",
            "type": "research",
            "category": "paper",
            "em": false,
            "title": "The letter S",
            "href": "http://rd.springer.com/article/10.1007%2FBF03023051#page-1",
            "description": "Several years ago when I began to look at the problem of designing suitable alphabets for use with modern printing equipment, I found that 25 of the letters were comparatively easy to deal with. The other letter was 'S'. For three days and nights I had a terrible time trying to understand how a proper 'S' could really be defined. The solution I finally came up with turned out to involve some interesting mathematics, and I believe that students of calculus and analytic geometry may enjoy looking into the question as I did. The purpose of this paper is to explain what I now consider to be the 'right' mathematics underlying printed S's, and also to give an example of the METAFONT language I have recently been developing."
          },
          {
            "number": "1.3.2",
            "type": "research",
            "category": "wikipedia",
            "em": false,
            "title": "Computer Modern",
            "href": "https://www.wikiwand.com/en/Computer_Modern",
            "description": "Computer Modern is the original family of typefaces used by the typesetting program TeX. It was created by Donald Knuth with his Metafont program, and was most recently updated in 1992. Computer Modern, or variants of it, remains very widely used in scientific publishing, especially in disciplines that make frequent use of mathematical notation."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.3.2.1",
            "type": "tech",
            "category": "book",
            "em": true,
            "title": "The Metafont Book",
            "href": "http://www.amazon.com/Metafont-Book-Donald-E-Knuth/dp/0201134446/",
            "description": "METAFONT is a system for the design of symbols and alphabetic characters suited to raster-based devices that print or display text. The construction of a typeface is an art form and this manual is written for people who wish to advance the quality of mathematical typesetting. The METAFONTbook enables readers, with only minimal computer science or word processing experience, to master the basic as well as the more advanced features of METAFONT programming. With this manual, readers will learn how to write a program using METAFONT that can customize a type design that already exists, create an entire alphabet from scratch, and create logos or special symbols."
          },
          {
            "number": "1.3.2.2",
            "type": "tech",
            "category": "book",
            "em": false,
            "title": "Digital Typography (Lecture Notes)",
            "href": "http://www.amazon.com/Digital-Typography-Lecture-Notes-Donald/dp/1575860104",
            "description": "In this collection, the second in the series, Knuth explores the relationship between computers and typography. The present volume, in the words of the author, is a legacy to all the work he has done on typography. When he thought he would take a few years' leave from his main work on the art of computer programming, as is well known, the short typographic detour lasted more than a decade. When type designers, punch cutters, typographers, book historians, and scholars visited the University during this period, it gave to Stanford what some consider to be its golden age of digital typography. By the author's own admission, the present work is one of the most difficult books that he has prepared. This is truly a work that only Knuth himself could have produced."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.3.2.1.1",
            "type": "tech",
            "category": "software",
            "em": false,
            "title": "Metapolator",
            "href": "http://metapolator.com/home/",
            "description": "Metapolator is an open web tool for making many fonts. It supports working in a font design space, instead of one glyph, one face, at a time. With Metapolator, ‘pro’ font designers are able to create and edit fonts and font families much faster, with inherent consistency. They gain unique exploration possibilities and the tools to quickly adapt typefaces to different media and domains of use."
          },
          {
            "number": "1.3.2.1.2",
            "type": "tech",
            "category": "software",
            "em": true,
            "title": "Prototypo",
            "href": "https://www.prototypo.io/",
            "description": "Prototypo is a user-friendly parameter-based font generator being built by a team of fiery font and code lovers. You can learn more about the project on its home page or contact us at contact@prototypo.io."
          },
          {
            "number": "1.3.2.1.3",
            "type": "tech",
            "category": "software",
            "em": false,
            "title": "Font Ark",
            "href": "http://fontark.net/farkwp/",
            "description": "FontArk is an innovative browser-based font editor, font creator (BETA), featuring the most versatile real-time multiple glyph editing system."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.3.2.1.1.1",
            "type": "tech",
            "category": "",
            "em": false,
            "title": "Metapolator Community",
            "href": "https://plus.google.com/communities/110027004108709154749",
            "description": "Metapolator project discussions on Google+"
          },
          {
            "number": "1.3.2.1.1.2",
            "type": "tech",
            "category": "",
            "em": false,
            "title": "Metapolator Tumblr Blog",
            "href": "http://metapolator.tumblr.com/",
            "description": ""
          },
          {
            "number": "1.3.2.1.2.1",
            "type": "tech",
            "category": "",
            "em": false,
            "title": "Prototypo Release Video",
            "href": "https://www.youtube.com/watch?v=ueELKlfskuo",
            "description": ""
          }
        ]
      }
    ]
  }
]