[
  {
    "month": "May",
    "date": "10",
    "number": 7,
    "weekend": false,
    "title": "Font Loading",
    "sum": "FOUT or FOIT or something else? Behind these nerdy code-like acronyms, it is how much some of us care about web typography: the milliseconds delay matters. From a joke on the presidential candidates' websites to serious long draft to the w3 standard on native font loading API, Font Loading is an interesting and important area in Web Typography to dig in. It shows the difference between Web Typography and Print Typography: print doesn't need loading time to render the text, it is all pre-loaded and pre-rendered. But as in \"The New Web Typography\" points out, the web is a new medium, it brings new challenges and we are facing them heads on.",
    "levels": [
      {
        "links": [
          {
            "number": "1",
            "type": "tech",
            "category": "article",
            "em": false,
            "title": "Web Fonts for President 2016",
            "href": "https://www.zachleat.com/web/president-web-font/",
            "description": "US presidential candidates ordered by best font loading strategy."
          },
          {
            "number": "2",
            "type": "tech",
            "category": "tutorial",
            "em": false,
            "title": "Loading Web Fonts with the Web Font Loader",
            "href": "https://css-tricks.com/loading-web-fonts-with-the-web-font-loader/",
            "description": "In fact, this practice of letting a browser hide all the text that should be styled with a custom font is now called the ‘Flash of Invisible Text’, or FOIT, and is often regarded as the worst of all possible options. Scott Jehl has argued that this is a pretty bad idea for both performance and usability. Likewise, the Typekit help page on the matter states that “the FOUT approach makes for more immediately usable pages, particularly on slower network connections.” So as designers and developers we have to make a decision between FOUT or FOIT."
          },
          {
            "number": "3",
            "type": "tech",
            "category": "article",
            "em": true,
            "title": "Critical Web Fonts",
            "href": "https://www.zachleat.com/web/critical-webfonts/",
            "description": "The next iteration: critical FOFT. This method builds on the Flash of Faux Text (FOFT) using a two stages loading process (sounds like, but is not actually rocket science), but instead of a full Roman web font in the first stage, it loads a small subset of the Roman web font, in this case with only the upper case and lower case alphabetic characters."
          },
          {
            "number": "4",
            "type": "tech",
            "category": "article",
            "em": false,
            "title": "Font Loading Revisited with Font Events",
            "href": "https://www.filamentgroup.com/lab/font-events.html",
            "description": "Last month we wrote about an approach we’d been using to load web fonts in a more responsible manner than browsers tend to do by default. The purpose of the approach was to avoid a typically undesirable browser behavior we often refer to as the “FOIT” (Flash of Invisible Text), in which a browser hides all text that should be styled with a custom font until that font has finished loading."
          }
        ]
      },
      {
        "links": [
          {
            "number": "2.1",
            "type": "tech",
            "category": "doc",
            "em": false,
            "title": "Typekit Help Page on the Font Events",
            "href": "https://helpx.adobe.com/typekit/using/font-events.html",
            "description": "CSS Font Events; JavaScript Font Events; Controlling the Flash of Unstyled Text (or FOUT) using font events; Dynamic kits and font events; Styling fallback fonts using font events."
          },
          {
            "number": "2.2",
            "type": "tech",
            "category": "article",
            "em": true,
            "title": "Web Font Loading Patterns",
            "href": "http://bramstein.com/writing/web-font-loading-patterns.html",
            "description": "Web font load­ing may seem com­pli­cated, but it is ac­tu­ally quite sim­ple if you use these font load­ing pat­terns. Com­bine the pat­terns to cre­ate cus­tom font load­ing be­hav­iour that works in all browsers. Ba­sic font load­ing; Load­ing groups of fonts; Load­ing fonts with a time­out; Pri­ori­tised load­ing; Cus­tom font dis­play; Op­ti­mise for caching."
          },
          {
            "number": "3.1",
            "type": "tech",
            "category": "article",
            "em": false,
            "title": "Flash of Faux Text - Still More on Font Loading",
            "href": "https://www.zachleat.com/web/foft/",
            "description": "After we’ve defeated the Flash of Invisible Text, we also want to decrease the amount of reflow a user sees when the font switches from fallback to @font-face. We already split our CSS into critical and deferred, why not fonts? Prioritize your fonts by loading only your roman (or plain/normal) font first, which will cause the browser to use font synthesis to create faux-bold/italic versions automatically. Next, trigger requests for the real bold and italic fonts. This will minimize the amount of reflow while the user is reading the content."
          },
          {
            "number": "4.1",
            "type": "tech",
            "category": "article",
            "em": false,
            "title": "How we use web fonts responsibly, or, avoiding a @font-face-palm",
            "href": "https://www.filamentgroup.com/lab/font-loading.html",
            "description": "Using @font-face to load custom web fonts is a great feature to give our sites a unique and memorable aesthetic. However, when you use custom fonts on the web using standard techniques, they can slow down page load speed and hamper performance—both real and perceived. Luckily, we've figured out some methods to apply them carefully to ensure your site correctly balances usability, performance and style."
          },
          {
            "number": "4.2",
            "type": "tech",
            "category": "code",
            "em": false,
            "title": "loadCSS",
            "href": "https://github.com/filamentgroup/loadCSS",
            "description": "Referencing CSS files with link[rel=stylesheet] or @import will cause most browsers to delay page rendering while the stylesheet loads. This is desirable in many cases, but when loading stylesheets that are not critical to the initial rendering of a page, loadCSS (and upcoming web standards mentioned below) allows you to load stylesheets asynchronously, so they don’t block page rendering."
          }
        ]
      },
      {
        "links": [
          {
            "number": "2.2.1",
            "type": "tech",
            "category": "code",
            "em": true,
            "title": "Font Face Observer",
            "href": "https://github.com/bramstein/fontfaceobserver",
            "description": "Font Face Observer is a small @font-face loader and monitor (3.5KB minified and 1.3KB gzipped) compatible with any web font service. It will monitor when a web font is applied to the page and notify you. It does not limit you in any way in where, when, or how you load your web fonts. Unlike the Web Font Loader Font Face Observer uses scroll events to detect font loads efficiently and with minimum overhead."
          },
          {
            "number": "2.2.2",
            "type": "tech",
            "category": "doc",
            "em": false,
            "title": "Na­tive Font Load­ing API",
            "href": "https://drafts.csswg.org/css-font-loading/",
            "description": "This CSS module describes events and interfaces used for dynamically loading font resources."
          },
          {
            "number": "3.1.1",
            "type": "tech",
            "category": "article",
            "em": false,
            "title": "Web Font Tune-up Time: A Fun Font Fallback Event",
            "href": "http://blog.fonts.com/2011/08/web-font-tune-up-time-a-fun-font-fallback-event/",
            "description": "In my last article I talked about the importance of font fallbacks when using Web fonts – though truth be told, it’s important no matter what. But simply adding fallbacks to your CSS leaves a lot of loose ends lying about that are just waiting to trip up you and your users. Here we’ll go through exactly what to do, how to do it and why it’s important to address getting your fallback embedding and styles sorted out and just a bit more complete."
          }
        ]
      }
    ]
  },
  {
    "month": "May",
    "date": "09",
    "number": 6,
    "weekend": false,
    "title": "Combining Typefaces",
    "sum": "In “The Three Phases to Improve Your Typography”, I described Classic Phase and Master Phase. In retrospect, I could have made it much more clear and simpler by saying, Classic Phase is when you stick to typographic rules and master phase is when you know when and how to break them. Maybe “rule” is a poor choice of word, “principle” is a better word. The author of “The Value of Multi-Typeface Design Design” really amazed me with her knowledge and eyes for detail in typography. A must read.",
    "levels": [
      {
        "links": [
          {
            "number": "1",
            "type": "research",
            "category": "essay",
            "em": true,
            "title": "The Value of Multi-Typeface Design",
            "href": "https://blog.prototypr.io/the-value-of-multi-typeface-design-ccd67227b0ee#.dmpv9i86c",
            "description": "I want to present a counter argument and speak to the value of eclectic type systems, and how you can structure your projects in ways that will allow you to use more typefaces together effectively."
          },
          {
            "number": "2",
            "type": "research",
            "category": "book",
            "em": true,
            "title": "Combining Typefaces: Free guide to great typography",
            "href": "http://blog.typekit.com/2016/04/29/combining-typefaces-free-guide-to-great-typography/",
            "description": "This very brief “pocket guide” is for designers and developers who want to make better choices about type and build their typographic expertise. Successful typeface combinations are partly a matter of good taste, which can be tough to develop. And finding typefaces that work well together often takes more time than we (or our managers, or our spouses!) think it should."
          },
          {
            "number": "3",
            "type": "tech",
            "category": "tool",
            "em": false,
            "title": "Font Flame - Tinder for Font Pairing",
            "href": "http://fontflame.com/",
            "description": "Font Flame ambitiously tries to solve a problem most typography lovers have, namely font pairing.Even though this is still an early prototype, new features are continuously being rolled out. Hopefully in the end, it will be your go-to font pairing tool. Currently utilizing Google’s free font library, but there are plans to implement other sources."
          },
          {
            "number": "4",
            "type": "tech",
            "category": "",
            "em": false,
            "title": "Type Genius",
            "href": "http://www.typegenius.com/",
            "description": ""
          },
          {
            "number": "5",
            "type": "tech",
            "category": "",
            "em": false,
            "title": "Type Connection",
            "href": "http://www.typeconnection.com/",
            "description": ""
          },
          {
            "number": "6",
            "type": "tech",
            "category": "",
            "em": false,
            "title": "Discover Typography",
            "href": "http://discover.typography.com/",
            "description": ""
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1",
            "type": "tech",
            "category": "book",
            "em": false,
            "title": "Eight Tips for Combining Typefaces",
            "href": "http://create.adobe.com/2013/12/1/eight_tips_for_combining_typefaces.html",
            "description": "The more effective combinations usually rely on typographic principles. These principles are not scientific, rigid, or fail-safe; all of them can be broken, but they should all be understood."
          },
          {
            "number": "1.2",
            "type": "research",
            "category": "book",
            "em": false,
            "title": "Typography for Lawyers",
            "href": "http://fontsinuse.com/uses/53/typography-for-lawyers",
            "description": ""
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1.2",
            "type": "research",
            "category": "tutorial",
            "em": true,
            "title": "Best Practices of Combining Typefaces",
            "href": "https://www.smashingmagazine.com/2010/11/best-practices-of-combining-typefaces/",
            "description": "Creating great typeface combinations is an art, not a science. Indeed, the beauty of typography has no borders. While there are no absolute rules to follow, it is crucial that you understand and apply some best practices when combining fonts in a design. When used with diligence and attention, these principles will always yield suitable results. Today we will take a close look at some the best practices for combining typefaces — as well as some blunders to avoid."
          },
          {
            "number": "1.2.1",
            "type": "research",
            "category": "book",
            "em": false,
            "title": "Butterick's Practical Typography",
            "href": "http://practicaltypography.com/",
            "description": "A few hun­dred years of type and ty­pog­ra­phy have es­tab­lished rules that only a fool would ig­nore. (Or a graphic de­signer keen to im­press his peers.) For all those who need to com­mu­ni­cate clearly and even add a mod­icum of aes­thetic value to their mes­sages, this pub­li­ca­tion pro­vides every­thing you al­ways wanted to ask but didn’t know how to."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1.2.1",
            "type": "research",
            "category": "article",
            "em": false,
            "title": "29 principles for making great font combinations",
            "href": "http://bonfx.com/29-principles-for-making-great-font-combinations/",
            "description": "When it comes to making font combinations, there are principles and methods, but no absolutes. You can’t apply all the principles or ideas listed here at the same time. Just peruse this list of ideas and see what strikes you as interesting, and then pursue creating your own interesting typeface pairs!"
          },
          {
            "number": "1.1.2.2",
            "type": "research",
            "category": "",
            "em": false,
            "title": "U&lc Mixing Typefaces, September 1992",
            "href": "http://www.as8.it/handouts/mixing-typefaces_U&lc1992.pdf",
            "description": ""
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1.2.1.1",
            "type": "research",
            "category": "book",
            "em": false,
            "title": "The Big Book of Font Combinations",
            "href": "http://bonfx.com/the-big-book-of-font-combinations/?cmp=bbofc1",
            "description": "The BBOFC is an expansive collection of carefully crafted typeface pair samples. The font pairings in BBOFC will inspire you and give you back time you need for your design projects. Use the combination examples straight out of the BBOFC in your next project, with other typeface software, or use them as a springboard for your own creativity. However you use the BBOFC, it’s bound to inspire and is a trustworthy companion to consult for all kinds of design projects and general study of typography."
          }
        ]
      }
    ]
  },
  {
    "month": "May",
    "date": "08",
    "number": 5,
    "weekend": true,
    "title": "OpenType Features",
    "sum": "The highlight of my last year was working with Tim Brown on launching the \"Caring about OpenType features\" lesson on practice Typekit. Doing the lesson helped me understand what OpenType is and means to Web Typography. But a few days ago, while making this website you are looking at, I discovered a new OpenType feature I wasn't aware of, historical ligature. OpenType is a treasure land, and I certainly enjoyed digging in.",
    "levels": [
      {
        "links": [
          {
            "number": "1",
            "type": "tech",
            "category": "tutorial",
            "em": true,
            "title": "Caring about OpenType features",
            "href": "http://practice.typekit.com/lesson/caring-about-opentype-features/",
            "description": "More than fancy swashes and superfluous ligatures, OpenType features are font superpowers. The best, most capable typefaces are full of sophisticated reasoning and delightful surprises — things that are often integral to the design of the type itself, or that help it work better for specific typesetting tasks. Using OpenType features is easy when you know they exist, are enabled, and are supported in browsers and applications."
          },
          {
            "number": "2",
            "type": "research",
            "category": "essay",
            "em": false,
            "title": "Advanced web typography: A recap on OpenType features",
            "href": "http://www.elliotjaystocks.com/blog/a-recap-on-opentype-features/",
            "description": "Browser support has improved, progress seems to have slowed and the varying levels of support are still pretty confusing. So let’s try and demystify some of this. The four areas I covered previously were: ligatures, small caps and old style numerals (with subsets for polyfilling), swashes (with subsets again), and stylesets."
          },
          {
            "number": "3",
            "type": "tech",
            "category": "code",
            "em": false,
            "title": "Introducing Normalize-OpenType.css",
            "href": "http://kennethormandy.com/journal/normalize-opentype-css",
            "description": "Following the same normalising approach as its namesake, Normalize-OpenType.css only includes CSS that applies OpenType features to basic HTML elements, like <body>, <table>, and <time>. If your font includes OpenType features, your typography will be improved in supported browsers. If not, nothing else will be affected."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1",
            "type": "tech",
            "category": "book",
            "em": false,
            "title": "The OpenType Cookbook",
            "href": "http://opentypecookbook.com/",
            "description": "OpenType features allow fonts to behave smartly. This behavior can do simple things (e.g. change letters to small caps) or they can do complex things (e.g. insert swashes, alternates, and ligatures to make text set in a script font feel handmade). This cookbook aims to be a designer…"
          },
          {
            "number": "2.1",
            "type": "research",
            "category": "essay",
            "em": false,
            "title": "Tomorrow’s Web Type Today Series",
            "href": "http://www.elliotjaystocks.com/blog/the-fine-flourish-of-the-ligature/",
            "description": "In preparation for my talks at TYPO Berlin next week and Ampersand next month, I’m brushing up on a load of future-facing techniques to do with typography on the web. I’m calling this series of posts ‘tomorrow’s web type today’ and I’m using each post’s heading to demonstrate a particular technique."
          },
          {
            "number": "3.1",
            "type": "tech",
            "category": "tool",
            "em": true,
            "title": "The State of Web Type",
            "href": "http://stateofwebtype.com/",
            "description": "Up-to-date data on support for type and typographic features on the web."
          },
          {
            "number": "3.2",
            "type": "tech",
            "category": "tool",
            "em": true,
            "title": "Utility OpenType",
            "href": "http://utility-opentype.kennethormandy.com/",
            "description": "Utility OpenType helps you make the most of the font that you are loading in, reducing convoluted CSS into four-letter, typographic utility classes, because: 1. OpenType features should be as easy to apply as bold and italics. 2. OpenType features should cascade predictably. 3. OpenType features should fallback gracefully."
          }
        ]
      },
      {
        "links": [
          {
            "number": "3.1.1",
            "type": "tech",
            "category": "tool",
            "em": false,
            "title": "OpenType features in web browsers — Tests (outdated)",
            "href": "https://www.typotheque.com/articles/opentype_features_in_web_browsers_-_tests",
            "description": "A collection of tests for OpenType feature support in web browsers. Based on the latest draft of the CSS Fonts Module Level 3 specification, and the latest public version of each browser."
          },
          {
            "number": "3.1.2",
            "type": "tech",
            "category": "spec",
            "em": false,
            "title": "OpenType Specification",
            "href": "https://www.microsoft.com/en-us/Typography/OpenTypeSpecification.aspx",
            "description": "OpenType 1.70 is fully equivalent to the ISO/IEC 14496-22:2015 (3rd edition) “Open Font Format” standard. The standard will be published in June 2015 and at that time will be freely available for download from the ISO website."
          }
        ]
      }
    ]
  },
  {
    "month": "May",
    "date": "07",
    "number": 4,
    "weekend": true,
    "title": "Color Palettes Generator",
    "sum": "Among my many failed attempts to finish a project, the one I go back to the most is the color theory project. Color is an interesting subject, because for 1) it has the right amount of art aspect in it, and 2) it can be explained and explored with code, and 3) it is the other fundamental part of design, just like typography. Plus I own an awesome domain for it, the only one that .space is not just for its cheapness: codecolor.space, code color space, how clever! One day!",
    "levels": [
      {
        "links": [
          {
            "number": "1",
            "type": "tech",
            "category": "article",
            "em": true,
            "title": "How To Avoid Equidistant HSV Colors",
            "href": "https://vis4.net/blog/posts/avoid-equidistant-hsv-colors/",
            "description": "… taking equidistant colors in the HSV color space is no solution for finding a set of colors that are perceived as equidistant. This post describes what’s wrong with HSV and what we can do about this."
          },
          {
            "number": "2",
            "type": "tech",
            "category": "paper",
            "em": false,
            "title": "HCL-Based Color Palettes in R",
            "href": "https://cran.r-project.org/web/packages/colorspace/vignettes/hcl-colors.pdf",
            "description": "The package colorspace provides various functions providing perceptually-based color palettes for coding categorical data (qualitative palettes) and numerical variables (sequential and diverging palettes). We illustrate how these functions can be employed to generate various flavours of these palettes (with different emphases) and how they can be plugged into R graphics functions."
          },
          {
            "number": "3",
            "type": "tech",
            "category": "tool",
            "em": true,
            "title": "Coolors",
            "href": "https://coolors.co/",
            "description": "Generate infinite color palettes for your designs and share, export or save it in your profile."
          },
          {
            "number": "4",
            "type": "tech",
            "category": "tool",
            "em": false,
            "title": "COLOURlovers",
            "href": "http://www.colourlovers.com/",
            "description": "COLOURlovers is a creative community where people from around the world create and share colors, palettes and patterns, discuss the latest trends and explore colorful articles... All in the spirit of love."
          },
          {
            "number": "5",
            "type": "tech",
            "category": "tool",
            "em": false,
            "title": "Material Palette",
            "href": "http://www.materialpalette.com/",
            "description": "Material Design Palette Generator"
          },
          {
            "number": "6",
            "type": "tech",
            "category": "tool",
            "em": false,
            "title": "CSS Drive: Image to Colors Palette Generator",
            "href": "http://www.cssdrive.com/imagepalette/",
            "description": "Welcome to CSS Drive's Image to Colors Palette Generator! Upload an image to generate a color palette based on the image's primary colors. Useful for quickly grabbing a particular color within an image for inspiration."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1",
            "type": "tech",
            "category": "tool",
            "em": false,
            "title": "Color Brewer",
            "href": "http://colorbrewer2.org/",
            "description": "An Online Tool for Selecting Colour Schemes for Maps. Choosing effective colour schemes for thematic maps is surprisingly difficult. ColorBrewer is an online tool designed to take some of the guesswork out of this process by helping users select appropriate colour schemes for their speciffic mapping needs by considering: the number of data classes; the nature of their data (matched with sequential, diverging and qualitative schemes); and the end-use environment for the map (e.g. CRT, LCD, printed, projected, photocopied)."
          },
          {
            "number": "1.2",
            "type": "tech",
            "category": "code",
            "em": false,
            "title": "chroma.js",
            "href": "https://github.com/gka/chroma.js",
            "description": "Chroma.js is a tiny JavaScript library (12kB) for all kinds of color conversions and color scales."
          },
          {
            "number": "1.3",
            "type": "tech",
            "category": "tool",
            "em": false,
            "title": "Colors for Data Scientists",
            "href": "http://tools.medialab.sciences-po.fr/iwanthue/",
            "description": "Generate and refine palettes of optimally distinct colors."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1.1",
            "type": "tech",
            "category": "paper",
            "em": false,
            "title": "ColorBrewer: An Online Tool for Selecting Color Schemes for Maps. The Cartographic Journal 40(1): 27-37.",
            "href": "http://www.albany.edu/faculty/fboscoe/papers/harrower2003.pdf",
            "description": "An understanding of how to manipulate the three perceptual dimensions of colour (hue, saturation and lightness) is required to create attractive and logical colour sequences for thematic maps. These dimensions are three of the visual variables or basic ‘building blocks’ of graphics (Bertin, 1983). Nearly a century of colour theory development combined with perceptual testing has allowed us to better understand how individuals perceive and understand colour. From a semiotic perspective, colour works as a ‘sign vehicle’ when the map reader is able to understand that a specic colour on the map represents or stands for something in the real world and that multiple occurrences of that colour stand for the same kind of thing (MacEachren, 71995)."
          },
          {
            "number": "1.3.1",
            "type": "tech",
            "category": "essay",
            "em": true,
            "title": "Colors for Data Scientists: Color Theory",
            "href": "http://tools.medialab.sciences-po.fr/iwanthue/theory.php",
            "description": "Distributing colors evenly, in a perceptively coherent space, constrained by user-friendly settings, to generate high quality custom palettes. Which is the best way to generate random colors? This was my starting point."
          },
          {
            "number": "1.3.2",
            "type": "tech",
            "category": "experiment",
            "em": false,
            "title": "Random Colors: Experiment",
            "href": "http://tools.medialab.sciences-po.fr/iwanthue/experiment.php",
            "description": "Choose a generator and look at how the random colors are distributed. The purpose here is to observe the properties of different generators of colors."
          }
        ]
      }
    ]
  },
  {
    "month": "May",
    "date": "06",
    "number": 3,
    "weekend": false,
    "title": "Variable Fonts",
    "sum": "4 weeks ago, among my many adventures of link clicking at late night, I found out about Variable Fonts. Reading Nick Sherman’s article about his vision of Web Typography in the future really excited me. Though at the time I thought it is pure science fiction — in type realm, too futuristic and too many development obstacles. 3 weeks ago, I went to San Francisco for my job. At one dinner with coworkers, because of my lacking in experience with babies and child education and ability to hold such conversation, I started a random new topic about variable fonts with another quiet dinner-goer. A few minutes later I started to get excited because I heard some exciting development on this subject, which was happening as we spoke. I love my job.",
    "levels": [
      {
        "links": [
          {
            "number": "1",
            "type": "research",
            "category": "essay",
            "em": true,
            "title": "The New Web Typography",
            "href": "https://robinrendle.com/essays/new-web-typography/",
            "description": "Web typography is only as strong as its weakest point… It’s often difficult to identify where the weakness in a design system can be found because a failure in programming will often cause a surprising failure in the aesthetics, and vice versa. Take the current implementation of declaring a font-weight in css. At the moment it’s horrendously limiting, and I think this has the effect of blinding us… I believe that these weaknesses in the programming—in the technical limitations of css and within the font formats themselves—have slowly become a weakness in aesthetics."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1",
            "type": "research",
            "category": "essay",
            "em": true,
            "title": "Efficient Web Type, c. 1556",
            "href": "http://kennethormandy.com/journal/efficient-web-type-circa-1556",
            "description": "Haultin’s performance issues in type design mirror our performance issues on the web: “How might a text be received, and read, more efficiently?”. He suggests answers to this this through the design of type itself, but that’s not the only place where this question needs an answer; we’re still facing the same question of typography efficiency today—but much more often it occurs on the web, and less so in the bible. … Practice, taking advantage of established approaches. Prospects, looking to upcoming technologies. Precedence, viewing the punchcutter’s process as precedence for designer’s role in web performance."
          },
          {
            "number": "1.2",
            "type": "research",
            "category": "essay",
            "em": true,
            "title": "Variable Fonts for Responsive Design",
            "href": "http://alistapart.com/blog/post/variable-fonts-for-responsive-design",
            "description": "Choosing typefaces for use on the web today is a practice of specifying static fonts with fixed designs. But what if the design of a typeface could be as flexible and responsive as the layout it exists within?"
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.2.1",
            "type": "tech",
            "category": "archive",
            "em": false,
            "title": "Multiple Master Fonts",
            "href": "http://partners.adobe.com/public/developer/opentype/index_mult_master.html",
            "description": "Multiple master fonts are Type 1 font programs that include two or more \"master\" fonts within a single font file. It allows users to interpolate many intermediate \"instances\" of the typeface. The fonts have one or more \"axes\" which might typically represent the weight, width, or optical size of the font. Thus the user can generate a very large number of variations from a single font - thus providing unprecedented flexibility."
          },
          {
            "number": "1.2.2",
            "type": "tech",
            "category": "code",
            "em": false,
            "title": "Font‑To‑Width (FTW!)",
            "href": "http://font-to-width.com/",
            "description": "Font‑To‑Width (FTW!) is a script by Nick Sherman and Chris Lewis that takes advantage of large type families to fit pieces of text snugly within their containers. Unlike other text-fitting tools like FitText.js, Font‑To‑Width does not scale the font-size (at least not by default). Instead, it chooses a width or weight variant according to what fits best, and then allows for letter- and word-spacing adjustments as needed."
          },
          {
            "number": "1.2.3",
            "type": "tech",
            "category": "code",
            "em": true,
            "title": "Live Font Interpolation on the Web",
            "href": "http://alistapart.com/article/live-font-interpolation-on-the-web",
            "description": "As typographers, designers, and developers, we can solve this problem. But we’ll need to work together to make webfonts more systemized and context-aware. Live webfont interpolation—the modification of a font’s design in the browser—exists today and can serve as an inroad for using truly responsive typography."
          },
          {
            "number": "1.2.4",
            "type": "research",
            "category": "essay",
            "em": false,
            "title": "Font Hinting and the Future of Responsive Typography",
            "href": "http://alistapart.com/column/font-hinting-and-the-future-of-responsive-typography",
            "description": "Thinking about it in these terms, hinting is responsive type that existed before the web: The font performs a media query of sorts to learn its size, then responds by repositioning points in each glyph according to built-in instructions, or “hints.”. In other words, hinting is to fonts what responsive layout is to websites. It allows a single font file to adapt to a variety of contexts, the same way CSS allows a single HTML file to adapt to a variety of contexts."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.2.3.1",
            "type": "research",
            "category": "tool",
            "em": true,
            "title": "A Glossary of Common Type Terminology",
            "href": "https://www.fontshop.com/glossary/",
            "description": ""
          },
          {
            "number": "1.2.3.2",
            "type": "tech",
            "category": "story",
            "em": false,
            "title": "MutatorMath",
            "href": "http://letterror.com/2014/09/19/mutatormath/",
            "description": "Together with Petr van Blokland and Just van Rossum, we added algorithm support for the basic contour and glyph objects in RoboFog around 1997. This meant glyph objects could participate in basic math operations. This resulted in a reduction in code and at the same time invited a new level of complexity."
          },
          {
            "number": "1.2.3.3",
            "type": "tech",
            "category": "math",
            "em": false,
            "title": "Interpolation Theory",
            "href": "http://www.lucasfonts.com/about/interpolation-theory/",
            "description": "Luc(as) de Groot’s Interpolation Theory is a theory about the optical behaviour of a family of fonts of increasing weight. It has resulted in a formula for calculating intermediate weights that has been influential among type designers the world over."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.2.3.2.1",
            "type": "research",
            "category": "essay",
            "em": false,
            "title": "The Adobe Originals Silver Anniversary Story: How the Originals endured in an ever-changing industry",
            "href": "http://blog.typekit.com/2014/07/30/the-adobe-originals-silver-anniversary-story-how-the-originals-endured-in-an-ever-changing-industry/",
            "description": "This is the seventh in a series of articles from Tamye Riggs, a longtime lover of type who is working with us to celebrate the twenty-fifth anniversary of the Adobe Originals type design program. This post explores multiple master fonts and OpenType, and how the Adobe Type team continued to innovate in type design and font technology."
          },
          {
            "number": "1.2.3.2.2",
            "type": "tech",
            "category": "tool",
            "em": false,
            "title": "New from Adobe Type: Open-sourced font development tools",
            "href": "http://blog.typekit.com/2014/09/19/new-from-adobe-type-open-sourced-font-development-tools/",
            "description": "The AFDKO, or Adobe Font Development Kit for OpenType — is now available with an Apache open source license… recently we’ve been using the ADFKO in conjunction with Superpolator from Erik van Blokland, which provides a convenient user interface and a level of flexibility unavailable with other interpolation tools."
          }
        ]
      }
    ]
  },
  {
    "month": "May",
    "date": "05",
    "number": 2,
    "weekend": false,
    "title": "Vertical Rhythm",
    "sum": "While designing this website, I was torn on whether I should make it stick to a vertical grid. I read many articles about this particular topic. The one I agree the most is “The New Web Typography”. For the past few years, Web Typography is playing catch up, trying to achieve what has been done on the print. Web is a new medium, very different than print, and it is facing a lot of new challenges. Instead of doing everything “by the book”, new rules should be defined, and old rules that don't apply anymore should be tossed. Treat Web Typography as its own unique art form and medium.",
    "levels": [
      {
        "links": [
          {
            "number": "1",
            "type": "tech",
            "category": "essay",
            "em": false,
            "title": "Web typography is broken. Here’s how we can fix it",
            "href": "http://www.studiothick.com/essays/web-typography-is-broken/",
            "description": "Questing for the holy grail of web typography: a baseline, cap height, and more in CSS. An exploration in setting type on the web, using MegaType, and other tools."
          },
          {
            "number": "2",
            "type": "tech",
            "category": "essay",
            "em": true,
            "title": "Is Web Typography Completely Broken?",
            "href": "http://zellwk.com/blog/web-typography-broken/",
            "description": "I recently came across an article titled “Web typography is broken. Here’s how we can fix it”. A mix of emotions rushed through me while I read through it. I realized that the biggest argument Tom was making in the article was that web typography is broken because type doesn’t sit perfectly on a baseline grid… I knew the importance of Vertical Rhythm and the baseline grid. I also knew that details matter when it comes to design. But is this one detail enough to break web typography?"
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1",
            "type": "tech",
            "category": "tutorial",
            "em": true,
            "title": "Technical Web Typography: Guidelines and Techniques",
            "href": "https://www.smashingmagazine.com/2011/03/technical-web-typography-guidelines-and-techniques/",
            "description": "We’ll focus on technical type in this article. We’ll discuss the intricacies and nuances of a small set of rules while learning the code to create them. We’ll learn about: How to choose a font face; How to choose a font size; Using a grid; Working out the measure; Vertical rhythm and baseline grids; Choosing a typographic scale; How to use proper quotes; How to use proper dashes; How to use proper ellipses; How to hang punctuation; Dealing with images in grids."
          },
          {
            "number": "1.2",
            "type": "tech",
            "category": "tutorial",
            "em": false,
            "title": "Aligning Type to Baseline the Right Way Using SASS",
            "href": "https://medium.com/written-in-code/aligning-type-to-baseline-the-right-way-using-sass-e258fce47a9b#.a18ynsmfl",
            "description": "Vertical rhythm is about spacing body text or, more generally, vertical stacked elements, in a consistent manner to give structure and hierarchy to your content. The baseline on the other hand implies that content spread in multiple columns is horizontally aligned. These two key principles will always ensure your content with structure, hierarchy, and consistency, and make your body text more readable."
          },
          {
            "number": "1.3",
            "type": "research",
            "category": "essay",
            "em": false,
            "title": "Designing Faster with a Baseline Grid",
            "href": "http://www.teehanlax.com/blog/designing-faster-with-a-baseline-grid/",
            "description": "However, grids are nothing new and can be traced back to Middle Ages: in the 1220s/1240s, French architect Villard de Honnecourt designed construction canons based on geometry. These principles were later studied by typographers and designers in the beginning of the 20th century to reverse-engineer medieval canons of page construction. Among them, Van de Graaf, Rosarivo, and ultimately Tschichold who popularized his predecessors’ discoveries in his book The Form of the Book: Essays on the Morality of Good Design."
          },
          {
            "number": "2.1",
            "type": "tech",
            "category": "essay",
            "em": true,
            "title": "Why is Vertical Rhythm an Important Typography Practice?",
            "href": "http://zellwk.com/blog/why-vertical-rhythms/",
            "description": "So, in summary, Vertical Rhythm is important because it follows one of the principles of design – repetition. Repetition has the ability to make things feel that they belong together. It gives the feeling that someone has thought it all out, like it’s part of the plan. After discovering the link between Vertical Rhythm and Repetition, we went on and figured out several ways we could replicate 24px to bring some variations to the design. Finally, after getting tired of repeating 24px vertically, we tried repeating 24px horizontally as well."
          },
          {
            "number": "2.2",
            "type": "quote",
            "category": "essay",
            "quote": "We can trace a nervous path through the links and hearts that occupy our timelines. In search of answers, we’ve peeked under the covers of Material Design and examined hundreds of pattern libraries, since one of them might be secretly withholding the principles of good design within. But why are we obsessed with typographic rules? And if we were to make guidelines for setting text on the web, what form should those rules take?",
            "author": {
              "name": "Robin Rendle"
            },
            "cite": {
              "title": "The New Web Typography",
              "href": "https://robinrendle.com/essays/new-web-typography/"
            }
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1.1",
            "type": "research",
            "category": "essay",
            "em": true,
            "title": "Web Design is 95% Typography",
            "href": "https://ia.net/know-how/the-web-is-all-about-typography-period",
            "description": "95% of the information on the web is written language. It is only logical to say that a web designer should get good training in the main discipline of shaping written information, in other words: Typography."
          },
          {
            "number": "1.2.1",
            "type": "tech",
            "category": "code",
            "em": true,
            "title": "Megatype",
            "href": "http://www.servinglibrary.org/journal/3/letter-and-spirit",
            "description": "A responsive typographic baseline for the web."
          },
          {
            "number": "1.2.2",
            "type": "tech",
            "category": "code",
            "em": false,
            "title": "Sassline",
            "href": "https://sassline.com/",
            "description": "Sassline aims to spread better typography across the web. It can be used for prototyping, blogs or full website builds. It has recommended base typography styles and Sass mixins to work proportionally from the baseline grid using rems."
          },
          {
            "number": "1.2.3",
            "type": "tech",
            "category": "code",
            "em": false,
            "title": "Siegmeyer2",
            "href": "https://github.com/tbredin/Siegmeyer2",
            "description": "Siegmeyer2 is a static SMACSS boilerplate using Susy grids and Siegmeyer typographic rhythm. It can be used as a standalone boilerplate, or just the SCSS tools can be imported via installation as a bower component (recommended)."
          },
          {
            "number": "2.1.1",
            "type": "tech",
            "category": "essay",
            "em": false,
            "title": "Were We Wrong About Vertical Rhythm All Along?",
            "href": "http://zellwk.com/blog/wrong-about-vertical-rhythm/",
            "description": "Just a few days ago, I received a design critique from Aurobind (a font, newspaper and magazine designer) regarding my website. He specifically pointed out that the spaces between my paragraphs could be reduced to achieve a better effect. I was dumbfounded. I didn’t believe him at first since I was already using Vertical Rhythm. If I were to reduce the amount of space between paragraphs, wouldn’t I be breaking the Vertical Rhythm?"
          }
        ]
      }
    ]
  },
  {
    "month": "May",
    "date": "04",
    "number": 1,
    "weekend": false,
    "title": "Metafont",
    "sum": "Metafont was created almost 30 years ago. It is by no means a new finding. I was researching on parametric type design, and Metafont is just exactly what I was looking for. Maybe it is another living proof of the saying “There is nothing new under the sun”. But the new is always born from the old. Soon after I started digging Metafont, I found out about Metapolator and Prototype. These tools are being actively worked on. When I look into it, the latest update could be as late as just 2 days ago. This excites me.",
    "levels": [
      {
        "links": [
          {
            "number": "1",
            "type": "tech",
            "category": "article",
            "em": true,
            "title": "A Note on The Type",
            "href": "http://www.servinglibrary.org/journal/1/a-note-on-the-type",
            "description": "PEN = 0, 1, 1, 0, WEIGHT = 100, SLANT = 0, SUPERNESS = 0.75, CURLYNESS = 0:\nThis is Meta-the-difference-between-the-two-Font, a typeface designed by Dexter Sinister in 2010, and derived using MetaFont, the now-thirty-year-old computer typography system programmed by Donald Knuth in 1979."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1",
            "type": "tech",
            "category": "video",
            "em": false,
            "title": "David Reinfurt: \"Mathematical Typography\"",
            "href": "https://www.youtube.com/watch?v=koc5MDoGW8U",
            "description": "Simplicity: Ideals of Practice in Mathematics & the Arts\nGraduate Center, City University of New York, April 3-5, 2013"
          },
          {
            "number": "1.2",
            "type": "research",
            "category": "article",
            "em": false,
            "title": "Letter & Spirit",
            "href": "http://www.servinglibrary.org/journal/3/letter-and-spirit",
            "description": "In the early 1980s, on the pages of academic design journal Visible Language, a classic thesis-antithesis-synthesis played out around the technological and philosophical fine points of computer-assisted type design. Stanford professor Donald Knuth begins with his article, “The Concept of a Meta-font” (Winter 1981). Two years prior, Knuth had conceived and programmed MetaFont — a software that enabled users to generate unlimited numbers of fonts by controlling a limited set of parameters. The article is a performative account of his intervening attempts, using MetaFont to harness the essential “intelligence” of letterforms."
          },
          {
            "number": "1.3",
            "type": "research",
            "category": "video",
            "em": true,
            "title": "Working on My Letters and Problems With the S",
            "href": "http://www.webofstories.com/play/donald.knuth/55;jsessionid=1653AC9976D7AB2D3093F25FEC16545B",
            "description": ""
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.1.1",
            "type": "research",
            "category": "video",
            "em": false,
            "title": "Meta the Difference Between the Two Font 4D",
            "href": "http://www.kadist.org/en/work/meta-difference-between-two-font-4-d",
            "description": "2012, 16:06 minutes"
          },
          {
            "number": "1.3.1",
            "type": "research",
            "category": "paper",
            "em": false,
            "title": "The letter S",
            "href": "http://rd.springer.com/article/10.1007%2FBF03023051#page-1",
            "description": "Several years ago when I began to look at the problem of designing suitable alphabets for use with modern printing equipment, I found that 25 of the letters were comparatively easy to deal with. The other letter was 'S'. For three days and nights I had a terrible time trying to understand how a proper 'S' could really be defined. The solution I finally came up with turned out to involve some interesting mathematics, and I believe that students of calculus and analytic geometry may enjoy looking into the question as I did. The purpose of this paper is to explain what I now consider to be the 'right' mathematics underlying printed S's, and also to give an example of the METAFONT language I have recently been developing."
          },
          {
            "number": "1.3.2",
            "type": "research",
            "category": "wikipedia",
            "em": false,
            "title": "Computer Modern",
            "href": "https://www.wikiwand.com/en/Computer_Modern",
            "description": "Computer Modern is the original family of typefaces used by the typesetting program TeX. It was created by Donald Knuth with his Metafont program, and was most recently updated in 1992. Computer Modern, or variants of it, remains very widely used in scientific publishing, especially in disciplines that make frequent use of mathematical notation."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.3.2.1",
            "type": "tech",
            "category": "book",
            "em": true,
            "title": "The Metafont Book",
            "href": "http://www.amazon.com/Metafont-Book-Donald-E-Knuth/dp/0201134446/",
            "description": "METAFONT is a system for the design of symbols and alphabetic characters suited to raster-based devices that print or display text. The construction of a typeface is an art form and this manual is written for people who wish to advance the quality of mathematical typesetting. The METAFONTbook enables readers, with only minimal computer science or word processing experience, to master the basic as well as the more advanced features of METAFONT programming. With this manual, readers will learn how to write a program using METAFONT that can customize a type design that already exists, create an entire alphabet from scratch, and create logos or special symbols."
          },
          {
            "number": "1.3.2.2",
            "type": "tech",
            "category": "book",
            "em": false,
            "title": "Digital Typography (Lecture Notes)",
            "href": "http://www.amazon.com/Digital-Typography-Lecture-Notes-Donald/dp/1575860104",
            "description": "In this collection, the second in the series, Knuth explores the relationship between computers and typography. The present volume, in the words of the author, is a legacy to all the work he has done on typography. When he thought he would take a few years' leave from his main work on the art of computer programming, as is well known, the short typographic detour lasted more than a decade. When type designers, punch cutters, typographers, book historians, and scholars visited the University during this period, it gave to Stanford what some consider to be its golden age of digital typography. By the author's own admission, the present work is one of the most difficult books that he has prepared. This is truly a work that only Knuth himself could have produced."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.3.2.1.1",
            "type": "tech",
            "category": "software",
            "em": false,
            "title": "Metapolator",
            "href": "http://metapolator.com/home/",
            "description": "Metapolator is an open web tool for making many fonts. It supports working in a font design space, instead of one glyph, one face, at a time. With Metapolator, ‘pro’ font designers are able to create and edit fonts and font families much faster, with inherent consistency. They gain unique exploration possibilities and the tools to quickly adapt typefaces to different media and domains of use."
          },
          {
            "number": "1.3.2.1.2",
            "type": "tech",
            "category": "software",
            "em": true,
            "title": "Prototypo",
            "href": "https://www.prototypo.io/",
            "description": "Prototypo is a user-friendly parameter-based font generator being built by a team of fiery font and code lovers. You can learn more about the project on its home page or contact us at contact@prototypo.io."
          },
          {
            "number": "1.3.2.1.3",
            "type": "tech",
            "category": "software",
            "em": false,
            "title": "Font Ark",
            "href": "http://fontark.net/farkwp/",
            "description": "FontArk is an innovative browser-based font editor, font creator (BETA), featuring the most versatile real-time multiple glyph editing system."
          }
        ]
      },
      {
        "links": [
          {
            "number": "1.3.2.1.1.1",
            "type": "tech",
            "category": "",
            "em": false,
            "title": "Metapolator Community",
            "href": "https://plus.google.com/communities/110027004108709154749",
            "description": "Metapolator project discussions on Google+"
          },
          {
            "number": "1.3.2.1.1.2",
            "type": "tech",
            "category": "",
            "em": false,
            "title": "Metapolator Tumblr Blog",
            "href": "http://metapolator.tumblr.com/",
            "description": ""
          },
          {
            "number": "1.3.2.1.2.1",
            "type": "tech",
            "category": "",
            "em": false,
            "title": "Prototypo Release Video",
            "href": "https://www.youtube.com/watch?v=ueELKlfskuo",
            "description": ""
          },
          {
            "number": "1.3.2.1.2.2",
            "type": "tech",
            "category": "code",
            "em": false,
            "title": "Plumin.js",
            "href": "http://www.pluminjs.com/",
            "description": "Manipulating fonts with code has enabled designers to create new kinds of typefaces, increase their quality, and automate repetitive tasks. Plumin.js allows to create and manipulate fonts using javascript."
          }
        ]
      }
    ]
  }
]